wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/google-create-payment-request.json

{
  "amount": 100000,
  "currency": "USD",
  "country": "US",
  "payment_method": {
    "method": "googlepay",
    "token": "random-token",
    "card_suffix": "4111",
    "card_scheme": "VISA"
  },
  "external_identifier": "907184.1",
  "buyer": {
    "external_identifier": "lorem@ipsum",
    "billing_details": {
      "first_name": "John",
      "last_name": "Doe",
      "email_address": "lorem@ipsum",
      "phone_number": null,
      "address": {
        "city": null,
        "country": "US",
        "postal_code": "1234",
        "state": null,
        "line1": "10 hopewell street",
        "line2": null,
        "organization": "Wikimedia Foundation"
      }
    }
  },
  "statement_descriptor": {
		"description": "Wikimedia Foundation"
  }
}
