wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/google-create-transaction-success.json

{
    "type": "transaction",
    "id": "2d600db6-f2fd-4622-bf1c-5cd07d8c7bd8",
    "reconciliation_id": "1NcYBGxgnYkHEGXcjINdtY",
    "merchant_account_id": "default",
    "created_at": "2024-11-12T15:53:25.922617+00:00",
    "updated_at": "2024-11-12T15:53:27.427857+00:00",
    "amount": 1000,
    "authorized_amount": 0,
    "captured_amount": 0,
    "refunded_amount": 0,
    "currency": "USD",
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "US",
    "external_identifier": "252.6",
    "status":"authorization_succeeded",
    "intent":"authorize",
    "payment_method": {
        "type": "payment-method",
        "method": "googlepay",
        "mode": "googlepay",
        "label": "1111",
        "scheme": "visa",
        "expiration_date": "12\/26",
        "approval_url": null,
        "country": "MX",
        "currency": null,
        "details": {
            "bin": "411111",
            "card_type": "credit"
        },
        "last_replaced_at": null,
        "fingerprint": "a50b85c200ee0795d6fd33a5c66f37a4564f554355c5b46a756aac485dd168a4",
        "id": null,
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "googlepay",
    "instrument_type": "pan",
    "error_code": null,
    "payment_service": {
        "id": "9996be63-1e6f-4290-9d6e-b70f5d9b6bf8",
        "type": "payment-service",
        "payment_service_definition_id": "adyen-card",
        "method": "googlepay",
        "display_name": "Adyen"
    },
    "pending_review": false,
    "buyer": {
        "id": null,
        "type": "buyer",
        "display_name": null,
        "external_identifier": "dadedoyin@wikimedia.org",
        "billing_details": {
            "first_name": "Card",
            "last_name": "Holder Name",
            "email_address": "dadedoyin@wikimedia.org",
            "phone_number": null,
            "address": {
                "city": "Mountain View",
                "country": "US",
                "postal_code": "94043",
                "state": "CA",
                "state_code": null,
                "house_number_or_name": null,
                "line1": "1600 Amphitheatre Parkway",
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "recurring",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": null,
    "additional_identifiers": {
        "payment_service_authorization_id": null,
        "payment_service_capture_id": null,
        "payment_service_processor_id": null
    },
    "metadata": null,
    "authorized_at": null,
    "captured_at": null,
    "voided_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "succeeded",
    "multi_tender": false
}